
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/aws-ecs-terraform/actions/runs/3813495028)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=/aws/ecs/go-simple-server]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:761817748648:cluster/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=go-simple-server]
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0987943897935233f]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04569be9cc5bcc498]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-089be32b53ed93a44]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-034d6d26fe71ea68f]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/go-simple-server-target-group/8afa1aa532757fb2]
aws_security_group.alb: Refreshing state... [id=sg-063dfdb42dc033bce]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a0c6669630006012]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096a25608f5b80071]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08f97f54831d3942d]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0667441fb811d1d62]
aws_security_group.ecs: Refreshing state... [id=sg-041f51729fc1786ce]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a4fcc6d5cb800c01]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c1dce4975135cf8b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-012beb5fcb619b0c2]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e1193eb6f82459ec]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a74d238845291c01]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:loadbalancer/app/go-simple-server-alb/1e1884b0df6efa30]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1703941547]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-034d6d26fe71ea68f1080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d135d080dd37e251]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-091d85cb66945c032]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-073b879e0fec67ce4]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ecb9a2a63a31e7e9]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-012beb5fcb619b0c21080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c1dce4975135cf8b1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/go-simple-server-alb/1e1884b0df6efa30/c0028cfbd8873f18]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener-rule/app/go-simple-server-alb/1e1884b0df6efa30/c0028cfbd8873f18/5a85275c312eb69a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:761817748648:cluster/go-simple-server"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/go-simple-server:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/go-simple-server-target-group/8afa1aa532757fb2"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-041f51729fc1786ce",
            ]
          + subnets          = [
              + "subnet-08f97f54831d3942d",
              + "subnet-0a0c6669630006012",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 2s [id=arn:aws:ecs:ap-northeast-1:761817748648:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":13,"Program":"tfcmt","SHA1":"5cc7fab623549a63fffaec9ef62f8396477ccc76","Vars":{},"WorkflowName":"Terraform"} -->